Revit 2024 API
ExternalResourceReference.IsValidReference Method
 Checks whether the reference is in a valid format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsValidReference(
	ExternalResourceType resourceType
)
Visual Basic
Public Function IsValidReference ( _
	resourceType As ExternalResourceType _
) As Boolean
Visual C++
public:
bool IsValidReference(
	ExternalResourceType^ resourceType
)
Parameters
resourceType
Type: Autodesk.Revit.DB.ExternalResourceType
 The type of resource which the ExternalResourceReference should correspond to.
Return Value
 True if this is a valid ExternalResourceReference. False otherwise.
Remarks
 This function checks:
The server id corresponds to a valid server which implements IExternalResourceServer.
The server supports the given ExternalResourceType.
The reference information is well-formed.
 This function does not check whether the resource exists on the server.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace